; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_12 ?v5 ?v3)
             (pred_4 ?v8 ?v6)
             (pred_6 ?v5 ?v6)
             (pred_2 ?v4 ?v5 )
	     (pred_5 ?v5)
             (pred_10 ?v13)
             (pred_9 ?v8)
             (pred_1 ?v6)
             (pred_7 ?v5)
             (pred_3 ?v8)
             (pred_8 ?v5)
             (pred_11 ))



(:action op_2
:parameters (?v11 ?v12 ?v9 ?v7)
:precondition (and (pred_10 ?v11) (pred_10 ?v12) (pred_9 ?v9) (pred_1 ?v7)
          (pred_12 ?v11 ?v12) (pred_4 ?v9 ?v7)
                   (pred_6 ?v12 ?v7) (pred_5 ?v11) 
                   (pred_7 ?v12) (pred_3 ?v9))
:effect (and  (pred_8 ?v12) (not (pred_7 ?v12))))


(:action op_3
:parameters (?v11 ?v1)
:precondition (and (pred_10 ?v11) (pred_10 ?v1)
               (pred_5 ?v11) (pred_12 ?v11 ?v1) (pred_8 ?v1))
:effect (and (pred_5 ?v1) (not (pred_5 ?v11))))

(:action op_4
:parameters (?v11 ?v9)
:precondition (and (pred_10 ?v11) (pred_9 ?v9) 
                  (pred_5 ?v11) (pred_2 ?v9 ?v11) (pred_11 ))
:effect (and (pred_3 ?v9)
   (not (pred_2 ?v9 ?v11)) (not (pred_11 ))))


(:action op_5
:parameters (?v11 ?v10 ?v2)
:precondition (and (pred_10 ?v11) (pred_9 ?v10) (pred_9 ?v2)
                  (pred_5 ?v11) (pred_3 ?v2) (pred_2 ?v10 ?v11))
:effect (and (pred_3 ?v10) (pred_2 ?v2 ?v11)
        (not (pred_3 ?v2)) (not (pred_2 ?v10 ?v11))))

(:action op_1
:parameters (?v11 ?v9)
:precondition (and (pred_10 ?v11) (pred_9 ?v9) 
                  (pred_5 ?v11) (pred_3 ?v9))
:effect (and (pred_11 ) (pred_2 ?v9 ?v11) (not (pred_3 ?v9)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_12 obj_03 obj_01 obj_06 obj_09 obj_04 obj_02 obj_10 obj_20 obj_14 obj_19 obj_13 obj_15 obj_17 obj_08 obj_16
    obj_07 obj_05
    obj_11 obj_18
    )

    (:init
       (pred_11)

       (pred_10 obj_12)
       (pred_10 obj_03)
       (pred_10 obj_01)
       (pred_10 obj_06)
       (pred_10 obj_09)
       (pred_10 obj_04)
       (pred_10 obj_02)
       (pred_10 obj_10)
       (pred_10 obj_20)
       (pred_10 obj_14)
       (pred_10 obj_19)
       (pred_10 obj_13)
       (pred_10 obj_15)
       (pred_10 obj_17)
       (pred_10 obj_08)
       (pred_10 obj_16)
       (pred_1 obj_07)
       (pred_1 obj_05)
       (pred_9 obj_11)
       (pred_9 obj_18)

       (pred_12 obj_12 obj_09)
       (pred_12 obj_12 obj_03)
       (pred_12 obj_03 obj_04)
       (pred_12 obj_03 obj_01)
       (pred_12 obj_03 obj_12)
       (pred_12 obj_01 obj_02)
       (pred_12 obj_01 obj_06)
       (pred_12 obj_01 obj_03)
       (pred_12 obj_06 obj_10)
       (pred_12 obj_06 obj_01)
       (pred_12 obj_09 obj_20)
       (pred_12 obj_09 obj_04)
       (pred_12 obj_09 obj_12)
       (pred_12 obj_04 obj_14)
       (pred_12 obj_04 obj_02)
       (pred_12 obj_04 obj_03)
       (pred_12 obj_04 obj_09)
       (pred_12 obj_02 obj_19)
       (pred_12 obj_02 obj_10)
       (pred_12 obj_02 obj_01)
       (pred_12 obj_02 obj_04)
       (pred_12 obj_10 obj_13)
       (pred_12 obj_10 obj_06)
       (pred_12 obj_10 obj_02)
       (pred_12 obj_20 obj_15)
       (pred_12 obj_20 obj_14)
       (pred_12 obj_20 obj_09)
       (pred_12 obj_14 obj_17)
       (pred_12 obj_14 obj_19)
       (pred_12 obj_14 obj_04)
       (pred_12 obj_14 obj_20)
       (pred_12 obj_19 obj_08)
       (pred_12 obj_19 obj_13)
       (pred_12 obj_19 obj_02)
       (pred_12 obj_19 obj_14)
       (pred_12 obj_13 obj_16)
       (pred_12 obj_13 obj_10)
       (pred_12 obj_13 obj_19)
       (pred_12 obj_15 obj_17)
       (pred_12 obj_15 obj_20)
       (pred_12 obj_17 obj_08)
       (pred_12 obj_17 obj_14)
       (pred_12 obj_17 obj_15)
       (pred_12 obj_08 obj_16)
       (pred_12 obj_08 obj_19)
       (pred_12 obj_08 obj_17)
       (pred_12 obj_16 obj_13)
       (pred_12 obj_16 obj_08)
       (pred_7 obj_01)
       (pred_7 obj_03)
       (pred_6  obj_01 obj_07)
       (pred_6  obj_03 obj_05)
       (pred_8 obj_12)
       (pred_8 obj_06)
       (pred_8 obj_09)
       (pred_8 obj_04)
       (pred_8 obj_02)
       (pred_8 obj_10)
       (pred_8 obj_20)
       (pred_8 obj_14)
       (pred_8 obj_19)
       (pred_8 obj_13)
       (pred_8 obj_15)
       (pred_8 obj_17)
       (pred_8 obj_08)
       (pred_8 obj_16)

       (pred_4  obj_11 obj_07)
       (pred_4  obj_18 obj_05)
       (pred_2 obj_11 obj_02)
       (pred_2 obj_18 obj_13)
       (pred_5 obj_12)
    )

    (:goal (and
       (pred_2 obj_11 obj_15)
    ))
(:constraints
  (always (not (pred_5 obj_04)))
)
)

; plan
1. (op_3 obj_12 obj_09)
   deleted: (pred_5 obj_12)
   added: (pred_5 obj_09)
   goals met: 0 of 1
2. (op_3 obj_09 obj_20)
   deleted: (pred_5 obj_09)
   added: (pred_5 obj_20)
   goals met: 0 of 1
3. (op_3 obj_20 obj_14)
   deleted: (pred_5 obj_20)
   added: (pred_5 obj_14)
   goals met: 0 of 1
4. (op_3 obj_14 obj_19)
   deleted: (pred_5 obj_14)
   added: (pred_5 obj_19)
   goals met: 0 of 1
5. (op_3 obj_19 obj_02)
   deleted: (pred_5 obj_19)
   added: (pred_5 obj_02)
   goals met: 0 of 1
6. (op_4 obj_02 obj_11)
   deleted: (pred_2 obj_11 obj_02) (pred_11)
   added: (pred_3 obj_11)
   goals met: 0 of 1
7. (op_3 obj_02 obj_19)
   deleted: (pred_5 obj_02)
   added: (pred_5 obj_19)
   goals met: 0 of 1
8. (op_3 obj_19 obj_14)
   deleted: (pred_5 obj_19)
   added: (pred_5 obj_14)
   goals met: 0 of 1
9. (op_3 obj_14 obj_20)
   deleted: (pred_5 obj_14)
   added: (pred_5 obj_20)
   goals met: 0 of 1
10. (op_3 obj_20 obj_15)
   deleted: (pred_5 obj_20)
   added: (pred_5 obj_15)
   goals met: 0 of 1
11. (op_1 obj_15 obj_11)
   deleted: (pred_3 obj_11)
   added: (pred_11) (pred_2 obj_11 obj_15)
   goals met: 1 of 1
